{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "permute_2_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "permute_2_input"}, "inbound_nodes": []}, {"name": "permute_2", "class_name": "Permute", "config": {"name": "permute_2", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "dims": [1, 2, 3]}, "inbound_nodes": [[["permute_2_input", 0, 0, {}]]]}, {"name": "conv1_1", "class_name": "Conv2D", "config": {"name": "conv1_1", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_2", 0, 0, {}]]]}, {"name": "conv1_2", "class_name": "Conv2D", "config": {"name": "conv1_2", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "conv2_1", "class_name": "Conv2D", "config": {"name": "conv2_1", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "conv2_2", "class_name": "Conv2D", "config": {"name": "conv2_2", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"name": "conv3_1", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"name": "conv3_2", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_3", "class_name": "Conv2D", "config": {"name": "conv3_3", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"name": "conv4_1", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"name": "conv4_2", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_3", "class_name": "Conv2D", "config": {"name": "conv4_3", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "conv5_1", "class_name": "Conv2D", "config": {"name": "conv5_1", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "conv5_2", "class_name": "Conv2D", "config": {"name": "conv5_2", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"name": "conv5_3", "class_name": "Conv2D", "config": {"name": "conv5_3", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv5_3", 0, 0, {}]]]}, {"name": "fc6", "class_name": "Conv2D", "config": {"name": "fc6", "trainable": false, "filters": 4096, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "fc7", "class_name": "Conv2D", "config": {"name": "fc7", "trainable": false, "filters": 4096, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc6", 0, 0, {}]]]}, {"name": "score_fr", "class_name": "Conv2D", "config": {"name": "score_fr", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc7", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score_fr", 0, 0, {}]]]}, {"name": "score2", "class_name": "Conv2DTranspose", "config": {"name": "score2", "trainable": true, "filters": 1, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "score_pool4", "class_name": "Conv2D", "config": {"name": "score_pool4", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score2", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score_pool4", 0, 0, {}]]]}, {"name": "cropping2d_4", "class_name": "Cropping2D", "config": {"name": "cropping2d_4", "trainable": true, "cropping": [[0, 2], [0, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}], ["cropping2d_4", 0, 0, {}]]]}, {"name": "upsample", "class_name": "Conv2DTranspose", "config": {"name": "upsample", "trainable": true, "filters": 1, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["upsample", 0, 0, {}]]]}, {"name": "cropping2d_5", "class_name": "Cropping2D", "config": {"name": "cropping2d_5", "trainable": true, "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "upsample2", "class_name": "Conv2DTranspose", "config": {"name": "upsample2", "trainable": true, "filters": 1, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["cropping2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["upsample2", 0, 0, {}]]]}, {"name": "cropping2d_6", "class_name": "Cropping2D", "config": {"name": "cropping2d_6", "trainable": true, "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["cropping2d_6", 0, 0, {}]]]}], "input_layers": [["permute_2_input", 0, 0]], "output_layers": [["activation_1", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.009999999776482582, "momentum": 0.8999999761581421, "decay": 9.999999974752427e-07, "nesterov": true}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of33", "group1-shard2of33", "group1-shard3of33", "group1-shard4of33", "group1-shard5of33", "group1-shard6of33", "group1-shard7of33", "group1-shard8of33", "group1-shard9of33", "group1-shard10of33", "group1-shard11of33", "group1-shard12of33", "group1-shard13of33", "group1-shard14of33", "group1-shard15of33", "group1-shard16of33", "group1-shard17of33", "group1-shard18of33", "group1-shard19of33", "group1-shard20of33", "group1-shard21of33", "group1-shard22of33", "group1-shard23of33", "group1-shard24of33", "group1-shard25of33", "group1-shard26of33", "group1-shard27of33", "group1-shard28of33", "group1-shard29of33", "group1-shard30of33", "group1-shard31of33", "group1-shard32of33", "group1-shard33of33"], "weights": [{"name": "conv1_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"min": -0.3811927535954644, "scale": 0.0030991280780119056, "dtype": "uint8"}}, {"name": "conv1_1/bias", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.16351952506046669, "scale": 0.0016685665822496602, "dtype": "uint8"}}, {"name": "conv1_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.28683479147798874, "scale": 0.0029570597059586467, "dtype": "uint8"}}, {"name": "conv2_1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.21225521400863048, "scale": 0.0017117355968437943, "dtype": "uint8"}}, {"name": "conv2_2/bias", "shape": [128], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv3_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.23884906488306384, "scale": 0.0018094626127504836, "dtype": "uint8"}}, {"name": "conv3_1/bias", "shape": [256], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv3_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.11537183756921807, "scale": 0.0009304180449130489, "dtype": "uint8"}}, {"name": "conv3_2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv3_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.11971811795351552, "scale": 0.0010594523712700488, "dtype": "uint8"}}, {"name": "conv3_3/bias", "shape": [256], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv4_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.12610445303075454, "scale": 0.0010508704419229546, "dtype": "uint8"}}, {"name": "conv4_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.06866403771381752, "scale": 0.0006242185246710684, "dtype": "uint8"}}, {"name": "conv4_2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv4_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.06442195901683732, "scale": 0.0006194419136234358, "dtype": "uint8"}}, {"name": "conv4_3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv5_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.07823480566342672, "scale": 0.0006744379798571269, "dtype": "uint8"}}, {"name": "conv5_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv5_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.06600467597737032, "scale": 0.000550038966478086, "dtype": "uint8"}}, {"name": "conv5_2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "conv5_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.07378745324471418, "scale": 0.0006832171596732794, "dtype": "uint8"}}, {"name": "conv5_3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "fc6/kernel", "shape": [7, 7, 512, 4096], "dtype": "float32", "quantization": {"min": -0.028561952096574448, "scale": 0.00022141048136879417, "dtype": "uint8"}}, {"name": "fc6/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "fc7/kernel", "shape": [1, 1, 4096, 4096], "dtype": "float32", "quantization": {"min": -0.030492632507401356, "scale": 0.00026062079066155005, "dtype": "uint8"}}, {"name": "fc7/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint8"}}, {"name": "score2/kernel", "shape": [4, 4, 1, 1], "dtype": "float32", "quantization": {"min": -0.08954621185274686, "scale": 0.0008067226293040257, "dtype": "uint8"}}, {"name": "score2/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.043602436780929565, "scale": 1.0, "dtype": "uint8"}}, {"name": "score_fr/kernel", "shape": [1, 1, 4096, 1], "dtype": "float32", "quantization": {"min": -0.10130278643439798, "scale": 0.0007914280190187342, "dtype": "uint8"}}, {"name": "score_fr/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.0005616478738375008, "scale": 1.0, "dtype": "uint8"}}, {"name": "score_pool4/kernel", "shape": [1, 1, 512, 1], "dtype": "float32", "quantization": {"min": -1.1225001180873198, "scale": 0.006236111767151777, "dtype": "uint8"}}, {"name": "score_pool4/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.027710936963558197, "scale": 1.0, "dtype": "uint8"}}, {"name": "upsample/kernel", "shape": [8, 8, 1, 1], "dtype": "float32", "quantization": {"min": -0.10541550815105438, "scale": 0.00037466557513849406, "dtype": "uint8"}}, {"name": "upsample/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.6537549495697021, "scale": 1.0, "dtype": "uint8"}}, {"name": "upsample2/kernel", "shape": [8, 8, 1, 1], "dtype": "float32", "quantization": {"min": -0.05072895064949989, "scale": 7.820062923665141e-05, "dtype": "uint8"}}, {"name": "upsample2/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -4.377087593078613, "scale": 1.0, "dtype": "uint8"}}]}]}