{"modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "permute_2_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "permute_2_input"}, "inbound_nodes": []}, {"name": "permute_2", "class_name": "Permute", "config": {"name": "permute_2", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "dims": [1, 2, 3]}, "inbound_nodes": [[["permute_2_input", 0, 0, {}]]]}, {"name": "conv1_1", "class_name": "Conv2D", "config": {"name": "conv1_1", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_2", 0, 0, {}]]]}, {"name": "conv1_2", "class_name": "Conv2D", "config": {"name": "conv1_2", "trainable": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "conv2_1", "class_name": "Conv2D", "config": {"name": "conv2_1", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "conv2_2", "class_name": "Conv2D", "config": {"name": "conv2_2", "trainable": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"name": "conv3_1", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"name": "conv3_2", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_3", "class_name": "Conv2D", "config": {"name": "conv3_3", "trainable": false, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"name": "conv4_1", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"name": "conv4_2", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_3", "class_name": "Conv2D", "config": {"name": "conv4_3", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "conv5_1", "class_name": "Conv2D", "config": {"name": "conv5_1", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "conv5_2", "class_name": "Conv2D", "config": {"name": "conv5_2", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"name": "conv5_3", "class_name": "Conv2D", "config": {"name": "conv5_3", "trainable": false, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv5_3", 0, 0, {}]]]}, {"name": "fc6", "class_name": "Conv2D", "config": {"name": "fc6", "trainable": false, "filters": 4096, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "fc7", "class_name": "Conv2D", "config": {"name": "fc7", "trainable": false, "filters": 4096, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc6", 0, 0, {}]]]}, {"name": "score_fr", "class_name": "Conv2D", "config": {"name": "score_fr", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc7", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score_fr", 0, 0, {}]]]}, {"name": "score2", "class_name": "Conv2DTranspose", "config": {"name": "score2", "trainable": true, "filters": 1, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "score_pool4", "class_name": "Conv2D", "config": {"name": "score_pool4", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score2", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["score_pool4", 0, 0, {}]]]}, {"name": "cropping2d_4", "class_name": "Cropping2D", "config": {"name": "cropping2d_4", "trainable": true, "cropping": [[0, 2], [0, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}], ["cropping2d_4", 0, 0, {}]]]}, {"name": "upsample", "class_name": "Conv2DTranspose", "config": {"name": "upsample", "trainable": true, "filters": 1, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["upsample", 0, 0, {}]]]}, {"name": "cropping2d_5", "class_name": "Cropping2D", "config": {"name": "cropping2d_5", "trainable": true, "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "upsample2", "class_name": "Conv2DTranspose", "config": {"name": "upsample2", "trainable": true, "filters": 1, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cropping2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["upsample2", 0, 0, {}]]]}, {"name": "cropping2d_6", "class_name": "Cropping2D", "config": {"name": "cropping2d_6", "trainable": true, "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [50176, 1]}, "inbound_nodes": [[["cropping2d_6", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcwwAAAB0AGoBfABkAoMCUwApA07pAQAAAOn/////KQLaAUva\nB3NxdWVlemUpAdoBeakAcgYAAAD6HjxpcHl0aG9uLWlucHV0LTQtNzJhODM3OTE2ZjQzPtoIPGxh\nbWJkYT5IAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}], "input_layers": [["permute_2_input", 0, 0]], "output_layers": [["lambda_2", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.009999999776482582, "momentum": 0.8999999761581421, "decay": 9.999999974752427e-07, "nesterov": true}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of129", "group1-shard2of129", "group1-shard3of129", "group1-shard4of129", "group1-shard5of129", "group1-shard6of129", "group1-shard7of129", "group1-shard8of129", "group1-shard9of129", "group1-shard10of129", "group1-shard11of129", "group1-shard12of129", "group1-shard13of129", "group1-shard14of129", "group1-shard15of129", "group1-shard16of129", "group1-shard17of129", "group1-shard18of129", "group1-shard19of129", "group1-shard20of129", "group1-shard21of129", "group1-shard22of129", "group1-shard23of129", "group1-shard24of129", "group1-shard25of129", "group1-shard26of129", "group1-shard27of129", "group1-shard28of129", "group1-shard29of129", "group1-shard30of129", "group1-shard31of129", "group1-shard32of129", "group1-shard33of129", "group1-shard34of129", "group1-shard35of129", "group1-shard36of129", "group1-shard37of129", "group1-shard38of129", "group1-shard39of129", "group1-shard40of129", "group1-shard41of129", "group1-shard42of129", "group1-shard43of129", "group1-shard44of129", "group1-shard45of129", "group1-shard46of129", "group1-shard47of129", "group1-shard48of129", "group1-shard49of129", "group1-shard50of129", "group1-shard51of129", "group1-shard52of129", "group1-shard53of129", "group1-shard54of129", "group1-shard55of129", "group1-shard56of129", "group1-shard57of129", "group1-shard58of129", "group1-shard59of129", "group1-shard60of129", "group1-shard61of129", "group1-shard62of129", "group1-shard63of129", "group1-shard64of129", "group1-shard65of129", "group1-shard66of129", "group1-shard67of129", "group1-shard68of129", "group1-shard69of129", "group1-shard70of129", "group1-shard71of129", "group1-shard72of129", "group1-shard73of129", "group1-shard74of129", "group1-shard75of129", "group1-shard76of129", "group1-shard77of129", "group1-shard78of129", "group1-shard79of129", "group1-shard80of129", "group1-shard81of129", "group1-shard82of129", "group1-shard83of129", "group1-shard84of129", "group1-shard85of129", "group1-shard86of129", "group1-shard87of129", "group1-shard88of129", "group1-shard89of129", "group1-shard90of129", "group1-shard91of129", "group1-shard92of129", "group1-shard93of129", "group1-shard94of129", "group1-shard95of129", "group1-shard96of129", "group1-shard97of129", "group1-shard98of129", "group1-shard99of129", "group1-shard100of129", "group1-shard101of129", "group1-shard102of129", "group1-shard103of129", "group1-shard104of129", "group1-shard105of129", "group1-shard106of129", "group1-shard107of129", "group1-shard108of129", "group1-shard109of129", "group1-shard110of129", "group1-shard111of129", "group1-shard112of129", "group1-shard113of129", "group1-shard114of129", "group1-shard115of129", "group1-shard116of129", "group1-shard117of129", "group1-shard118of129", "group1-shard119of129", "group1-shard120of129", "group1-shard121of129", "group1-shard122of129", "group1-shard123of129", "group1-shard124of129", "group1-shard125of129", "group1-shard126of129", "group1-shard127of129", "group1-shard128of129", "group1-shard129of129"], "weights": [{"name": "conv1_1_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv1_1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1_2_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv1_2_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2_1_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2_2_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2_2_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3_1_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_2_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_2_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_3_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_3_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv4_1_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_2_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_2_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_3_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_3_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_1_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_2_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_3_1/bias", "shape": [512], "dtype": "float32"}, {"name": "fc6_1/kernel", "shape": [7, 7, 512, 4096], "dtype": "float32"}, {"name": "fc6_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "fc7_1/kernel", "shape": [1, 1, 4096, 4096], "dtype": "float32"}, {"name": "fc7_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "score2_1/kernel", "shape": [4, 4, 1, 1], "dtype": "float32"}, {"name": "score2_1/bias", "shape": [1], "dtype": "float32"}, {"name": "score_fr_1/kernel", "shape": [1, 1, 4096, 1], "dtype": "float32"}, {"name": "score_fr_1/bias", "shape": [1], "dtype": "float32"}, {"name": "score_pool4_1/kernel", "shape": [1, 1, 512, 1], "dtype": "float32"}, {"name": "score_pool4_1/bias", "shape": [1], "dtype": "float32"}, {"name": "upsample_1/kernel", "shape": [8, 8, 1, 1], "dtype": "float32"}, {"name": "upsample_1/bias", "shape": [1], "dtype": "float32"}, {"name": "upsample2_1/kernel", "shape": [8, 8, 1, 1], "dtype": "float32"}, {"name": "upsample2_1/bias", "shape": [1], "dtype": "float32"}]}]}